"use client";
import { Accordion, AccordionItem } from "@heroui/react";

const FaqAccordion = () => {
  const faqData = [
    {
      title: "آیا محصولات Zi Home اصل و دارای گارانتی هستند؟",
      content:
        "بله، تمامی محصولات موجود در Zi Home اورجینال بوده و همراه با گارانتی معتبر شرکتی عرضه می‌شوند.",
    },
    {
      title: "چطور می‌توانم سفارش خود را ثبت کنم؟",
      content:
        "کافی است محصول مورد نظر را انتخاب کرده، به سبد خرید اضافه کنید و مراحل پرداخت را تکمیل نمایید. سفارش شما پس از تأیید پردازش و ارسال خواهد شد.",
    },
    {
      title: "چه روش‌هایی برای پرداخت وجود دارد؟",
      content:
        "در حال حاضر امکان پرداخت آنلاین از طریق درگاه بانکی وجود دارد. به‌زودی روش‌های دیگری مانند پرداخت در محل نیز فعال خواهد شد.",
    },
    {
      title: "مدت زمان ارسال سفارش چقدر است؟",
      content:
        "سفارش‌ها معمولاً بین ۲ تا ۵ روز کاری بسته به موقعیت جغرافیایی مشتری تحویل داده می‌شوند.",
    },
    {
      title: "آیا امکان مرجوع کردن کالا وجود دارد؟",
      content:
        "بله، در صورت وجود مشکل یا مغایرت با سفارش، مشتریان می‌توانند ظرف ۷ روز کالا را بازگردانند. شرایط مرجوعی در صفحه قوانین و مقررات توضیح داده شده است.",
    },
    {
      title: "چطور می‌توانم از تخفیف‌ها و جشنواره‌ها مطلع شوم؟",
      content:
        "با عضویت در خبرنامه Zi Home و دنبال کردن ما در شبکه‌های اجتماعی، اولین نفری خواهید بود که از تخفیف‌ها باخبر می‌شوید.",
    },
    {
      title:
        "آیا Zi Home خدمات نصب و راه‌اندازی لوازم خانگی را هم ارائه می‌دهد؟",
      content:
        "بله، برای برخی محصولات بزرگ خانگی مانند یخچال، ماشین لباسشویی و کولر، خدمات نصب توسط نمایندگی‌های مجاز ارائه می‌شود.",
    },
  ];
  return (
    <div className="w-7/12">
      <Accordion variant="splitted">
        {faqData.map((item) => (
          <AccordionItem
            title={item.title}
            className="py-5 text-danger-500 font-semibold"
            key={item.title}
          >
            {item.content}
          </AccordionItem>
        ))}
      </Accordion>
    </div>
  );
};

export default FaqAccordion;
